-- phpMyAdmin SQL Dump
-- version 4.8.5
-- https://www.phpmyadmin.net/
--
-- 主机： localhost
-- 生成日期： 2020-04-11 07:40:01
-- 服务器版本： 5.7.26
-- PHP 版本： 7.3.4

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 数据库： `cqcq`
--

-- --------------------------------------------------------

--
-- 表的结构 `dorm`
--

CREATE TABLE `dorm` (
  `id` int(11) NOT NULL,
  `sex` varchar(8) NOT NULL,
  `dormNumber` varchar(16) NOT NULL COMMENT '宿舍号',
  `studentId` int(9) NOT NULL COMMENT '舍长学号',
  `grade` int(4) NOT NULL COMMENT '年级',
  `department` varchar(32) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `dorm`
--

INSERT INTO `dorm` (`id`, `sex`, `dormNumber`, `studentId`, `grade`, `department`) VALUES
(1, '男', '中二#103', 0, 2017, '计算机工程系'),
(2, '男', '中二#104', 0, 2017, '计算机工程系'),
(3, '男', '中二#105', 0, 2017, '计算机工程系'),
(4, '男', '中二#106', 0, 2017, '计算机工程系'),
(5, '男', '中二#107', 0, 2017, '计算机工程系'),
(6, '男', '中二#108', 0, 2017, '计算机工程系'),
(7, '男', '中二#111', 0, 2017, '计算机工程系'),
(8, '男', '中二#112', 0, 2017, '计算机工程系'),
(9, '男', '中二#113', 0, 2017, '计算机工程系'),
(10, '男', '中二#114', 0, 2017, '计算机工程系'),
(11, '男', '中二#115', 0, 2017, '计算机工程系'),
(12, '男', '中二#116', 0, 2017, '计算机工程系'),
(13, '男', '中二#117', 0, 2017, '计算机工程系'),
(14, '男', '中二#118', 0, 2017, '计算机工程系'),
(15, '男', '中二#119', 0, 2017, '计算机工程系'),
(16, '男', '中二#120', 0, 2017, '计算机工程系'),
(17, '男', '中二#121', 0, 2017, '计算机工程系'),
(18, '男', '中二#122', 0, 2017, '计算机工程系'),
(19, '男', '中二#123', 0, 2017, '计算机工程系'),
(20, '男', '中二#201', 0, 2017, '计算机工程系'),
(21, '男', '中二#202', 0, 2017, '计算机工程系'),
(22, '男', '中二#203', 0, 2017, '计算机工程系'),
(23, '男', '中二#204', 0, 2017, '计算机工程系'),
(24, '男', '中二#205', 0, 2017, '计算机工程系'),
(25, '男', '中二#206', 0, 2017, '计算机工程系'),
(26, '男', '中二#207', 0, 2017, '计算机工程系'),
(27, '男', '中二#208', 0, 2017, '计算机工程系'),
(28, '男', '中二#209', 0, 2017, '计算机工程系'),
(29, '男', '中二#210', 0, 2017, '计算机工程系'),
(30, '男', '中二#213', 0, 2017, '计算机工程系'),
(31, '男', '中二#214', 0, 2017, '计算机工程系'),
(32, '男', '中二#215', 0, 2017, '计算机工程系'),
(33, '男', '中二#216', 0, 2017, '计算机工程系'),
(34, '男', '中二#217', 0, 2017, '计算机工程系'),
(35, '男', '中二#218', 0, 2017, '计算机工程系'),
(36, '男', '中二#219', 0, 2017, '计算机工程系'),
(37, '男', '中二#220', 0, 2017, '计算机工程系'),
(38, '男', '中二#221', 0, 2017, '计算机工程系'),
(39, '男', '中二#222', 0, 2017, '计算机工程系'),
(40, '男', '中二#223', 0, 2017, '计算机工程系'),
(41, '男', '中二#224', 0, 2017, '计算机工程系'),
(42, '男', '中二#225', 0, 2017, '计算机工程系'),
(43, '男', '中二#301', 0, 2017, '计算机工程系'),
(44, '男', '中二#302', 0, 2017, '计算机工程系'),
(45, '男', '中二#303', 0, 2017, '计算机工程系'),
(46, '男', '中二#304', 0, 2017, '计算机工程系'),
(47, '男', '中二#305', 0, 2017, '计算机工程系'),
(48, '男', '中二#306', 0, 2017, '计算机工程系'),
(49, '男', '中二#307', 0, 2017, '计算机工程系'),
(50, '男', '中二#308', 0, 2017, '计算机工程系'),
(51, '男', '中二#309', 0, 2017, '计算机工程系'),
(52, '男', '中二#310', 0, 2017, '计算机工程系'),
(53, '男', '中二#313', 0, 2017, '计算机工程系'),
(54, '男', '中二#314', 0, 2017, '计算机工程系'),
(55, '男', '中二#325', 0, 2017, '计算机工程系'),
(56, '男', '中二#411', 0, 2017, '计算机工程系'),
(57, '女', '东二#410', 0, 2017, '计算机工程系'),
(58, '女', '东二#411', 0, 2017, '计算机工程系'),
(59, '女', '东二#412', 0, 2017, '计算机工程系'),
(60, '女', '东二#413', 0, 2017, '计算机工程系'),
(61, '女', '东二#414', 0, 2017, '计算机工程系'),
(62, '女', '东二#415', 0, 2017, '计算机工程系'),
(63, '女', '东二#416', 0, 2017, '计算机工程系'),
(64, '女', '东二#417', 0, 2017, '计算机工程系'),
(65, '女', '东二#418', 0, 2017, '计算机工程系'),
(66, '女', '东二#419', 0, 2017, '计算机工程系'),
(67, '女', '东二#421', 0, 2017, '计算机工程系'),
(68, '女', '东二#422', 0, 2017, '计算机工程系'),
(69, '女', '东二#423', 0, 2017, '计算机工程系'),
(70, '女', '东二#424', 0, 2017, '计算机工程系'),
(71, '女', '东二#425', 0, 2017, '计算机工程系'),
(72, '女', '东二#426', 0, 2017, '计算机工程系');

-- --------------------------------------------------------

--
-- 表的结构 `user`
--

CREATE TABLE `user` (
  `id` int(11) NOT NULL,
  `username` varchar(16) NOT NULL COMMENT '学生填宿舍号，辅导员填姓名',
  `password` varchar(32) NOT NULL COMMENT '密码，md5加密',
  `email` varchar(32) NOT NULL,
  `phone` varchar(11) NOT NULL,
  `face_url` varchar(250) DEFAULT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `user`
--

INSERT INTO `user` (`id`, `username`, `password`, `email`, `phone`, `face_url`) VALUES
(1, '中二#203', '202cb962ac59075b964b07152d234b70', '8', '17720762997', NULL),
(2, '中二#203', '202cb962ac59075b964b07152d234b70', '84', '17720762994', NULL);

--
-- 转储表的索引
--

--
-- 表的索引 `dorm`
--
ALTER TABLE `dorm`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `user`
--
ALTER TABLE `user`
  ADD PRIMARY KEY (`id`);

--
-- 在导出的表使用AUTO_INCREMENT
--

--
-- 使用表AUTO_INCREMENT `dorm`
--
ALTER TABLE `dorm`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=73;

--
-- 使用表AUTO_INCREMENT `user`
--
ALTER TABLE `user`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
